app/views/projects/new.html.erb

  <br>
  <%= u.collection_select :project_manager, User.all, :id, :name %>
---
SELECT "users".* FROM "users"