app/helpers/projects_helper.rb

  def company_projects
    @company_projects = Project.where(company_id: current_user.company.id)
---
SELECT "projects".* FROM "projects" WHERE "projects"."company_id" = ?  [["company_id", 2]]