app/controllers/companies_controller.rb

  def create
    @company = Company.new(company_params)
    @company.save
---
INSERT INTO "companies" ("name", "address", "phone_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Kiewit Corp"], ["address", "2154 Kiewit Drive"], ["phone_number", "4024024022"], ["created_at", "2019-09-12 04:03:49.936792"], ["updated_at", "2019-09-12 04:03:49.936792"]]