app/controllers/equipment_controller.rb

SELECT "equipment".* FROM "equipment"
---
  def index
    @equipment = Equipment.all