app/controllers/equipment_controller.rb

INSERT INTO "equipment" ("name", "rental_company", "make", "machine_type", "rental_rate_day", "company_id", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @equipment = Equipment.new(equipment_params)
    @equipment.save

SELECT "projects".* FROM "projects" WHERE "projects"."company_id" = ?  [["company_id", 1]]
SELECT "equipment".* FROM "equipment" WHERE "equipment"."company_id" = ?  [["company_id", 1]]
---
  def index

    @projects = Project.where(company_id: current_user.company_id)
    @equipment = Equipment.where(company_id: current_user.company_id)