app/controllers/projects_controller.rb

    def create
        @project = Project.new(project_params)
        @project.save
---
INSERT INTO "projects" ("name", "client_name", "address", "projectmanager_id", "company_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def show
        @project = Project.find_by_id(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]