app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."company_id" = ?  [["company_id", 1]]
---
    def show
        @projects = Project.where(company_id: current_user.company.id)

SELECT "projects".* FROM "projects" WHERE "projects"."company_id" = ?  [["company_id", 2]]
---
    def index
        @projects = Project.where(company_id: current_user.company.id)