app/controllers/users_controller.rb

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "users" ("name", "password_digest", "email", "phone_number", "created_at", "updated_at", "company_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        @user = User.new(user_params)
        @company = Company.find_by_id(user_params[:company_id])
        @user.company = @company
        @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$R23B6A02Htv4jWeR8Fg4N.1nQouMDS/e.SvFKNntmJOsSfPPRJlLK"], ["updated_at", "2019-09-14 18:52:35.260893"], ["id", 2]]
---
    def update
    @user = User.find_by(id: params[:id])
    @user.update(user_params)