app/models/projectmanager.rb

   def name
    User.find_by_id(user_id).name
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]